-- MySQL dump 10.13  Distrib 8.0.40, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: bookstore
-- ------------------------------------------------------
-- Server version	8.0.40

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `author`
--

DROP TABLE IF EXISTS `author`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `author` (
  `ID` tinyint NOT NULL AUTO_INCREMENT,
  `first_name` char(50) NOT NULL,
  `last_name` char(50) NOT NULL,
  `biography` mediumtext,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `author`
--

LOCK TABLES `author` WRITE;
/*!40000 ALTER TABLE `author` DISABLE KEYS */;
INSERT INTO `author` VALUES (1,'Ілларіон','Павлюк','Іларіон Станіславович Павлюк, який народився 14 травня 1980 р. у місті Скадовськ, Херсонська область, є видатним письменником, продюсером та начальником Управління преси та інформації МОУ. Здобувши докторський ступінь, Іларіон служить молодшим лейтенантом Збройних Сил України, беручи участь у російсько-українській війні та здійснюючи службу в Міністерстві оборони України.'),(2,'Андрій','Сем’янків','український лікар-анестезіолог, кандидат медичних наук, блогер, популяризатор доказової медицини. Автор науково-популярного бестселера «Медицина доказова і не дуже» та художньої книги «Танці з кістками», яка стала Книгою року BBC в 2022 році'),(3,'Юлія','Нагорнюк','Юлія Нагорнюк - сучасна українська письменниця і перекладачка. Народилася в місті Ланівці на Тернопільщині. Вчилася, а потім викладала на кафедрі перекладознавства й контрастивної лінгвістики ім. Григорія Кочура (ЛНУ ім. Івана Франка). '),(4,'Сергій','Скришевський','Сергій Скришевський - сучасний український письменник та блогер, автор квір-романів «У Штормовому - штиль» та «Однією ногою під Києвом», які публікуються у вітчизняному видавництві «Прометей».'),(5,'Павло','Дерев\'янко','Дерев\'янко Павло Сергійович - український письменник, військовослужбовець 12-ї бригади спеціального призначення «АЗОВ» Національної Гвардії України. 29 жовтня 2013 року самостійно видав роман «Крук» в пʼятидесяти примірниках, які роздав родичам, друзям і колегам.'),(6,'Ірина','Грабовська','Ірина Грабовська - сучасна українська письменниця та блогерка, відома своїми романами та оповіданнями в жанрі фентезі. Письменниця працювала над створенням хроніки «У вогняному кільці. Оборона Луганського аеропорту», книга була видана у 2018 році й мала успіх на українському книжковому ринку, проте на обкладинці книги ви не знайдете ім’я письменниці, адже вона публікувалась під псевдонімом Анастасія Воронова.'),(7,'Макс','Кідрук','Макс Кідрук - письменник, відомий своєю любов’ю до подорожей та описами мандрівок у книгах. Також Кідрук став відкривачем кількох нових для української літератури жанрів: тревелог та технотрилер.'),(8,'Бенджамін','Стівенсон','Бенджамін Стівенсон (Benjamin Stevenson) — популярний австралійський письменник і стендап-комік, чиї книги підкорили серця мільйонів читачів по всьому світу. Його твори здебільшого належать до жанру кримінального трилера, переплетеного з дотепним гумором, що робить його стиль унікальним і незабутнім.'),(9,'Голлі','Джексон','Голлі Джексон - сучасна британська письменниця, авторка детективних трилерів, які стали неймовірно популярними серед молоді.'),(10,'Тесс','Ґеррітсен','В юності майбутня письменниця захоплювалася природничими науками, особливо біологією, тому коли настав момент вибору професії Тесс коливалася недовго. Спочатку вона отримала ступінь бакалавра антропології в Стенфордському університеті, а в 1979 р, закінчивши Університет Каліфорнії в Сан-Франциско, отримала диплом лікаря. Ординатуру в якості лікаря-терапевта Тесс проходила в Гонолулу, де разом зі своїм чоловіком-лікарем, вона почала власну практику. Думки про можливість написати книгу прийшли в голову Тесс, коли вона тимчасово залишила лікарську практику в зв\'язку з народженням дитини. У 1987 році вийшов перший роман молодого лікаря \"Call after Midnight\", перший з восьми романів, написаний у жанрі романтичного трилера. Справжній успіх прийшов до письменниці в 1996 році, коли за наполяганням літературного агента вона вирішила перенести свій медичний досвід на сторінки книги. Перший же медичний трилер «Harvest» про нелегальну пересадку органів приніс письменниці приголомшливий успіх.'),(11,'Дар\'я','Чайка','Дар’я Чайка - вітчизняна письменниця-початківець, авторка нашумівшого в мережі квір-роману «Майже хороші хлопці», який побачив світ в українському видавництві «Видавництво».'),(12,'Ребекка','Кван','Ребекка Ф Кван - сучасна американська письменниця китайського походження, українським та світовим читачам відома завдяки дебютному фентезійному циклу «Макова війна». Народилася у 1996 у Гуанчжоу, коли дівчинці було 4 роки, її родина емігрувала до США й оселилась у Денвері, штат Колорадо. Освіту здобула у Джорджтаунському університеті у Вашингтоні, де вивчала історію, пізніше навчалась у Кембриджському університеті в Англії.'),(13,'Рік','Ріордан','Ім\'я цього американського автора знає, напевно, кожна дитина, тому що серія його книг про Персі Джексона підкорила підлітків усього світу. Купити книги Ріка Ріордана про сучасний хлопчика, який потрапив сином стародавнього олімпійського бога, прагнуть і дорослі, і діти. Захоплюючий сюжет і захоплюючі пригоди роблять їх ідеальним читанням для вечірнього дозвілля. Однак романи про Персі Джексона - це лише мала частина всіх книг Ріка Ріордана. Його перу належать численні цикли творів в жанрі фентезі, створені на основі давньогрецьких, єгипетських і скандинавських міфів, а також серії містичних детективів і графічних романів.'),(14,'Джордж','Дж. Мартін','Шлях до слави цього американського письменника, редактора, сценариста і продюсера не був легким. Однак докладені зусилля виправдали себе. На небосхилі сучасної фантастики він став найяскравішої зіркою. Купити книги Джорджа Мартіна шанувальники фентезі жадають з найбільшим нетерпінням. Йому належить авторство самого затребуваного фентезійного циклу останнього часу - «Пісня льоду і полум\'я». Після виходу першої книги серії, «Ігри престолів», про письменника заговорили як про рятівника жанру, яка вивела фентезі на якісно новий рівень. Але цей успіх приховав ранні досягнення фантаста. А тим часом всі книги Джорджа Мартіна заслуговують на увагу, тому як його талант дивно різноманітний. Визнання в США він домігся задовго до «Пісні ...».'),(15,'Дженніфер','Л. Арментраут','Популярна письменниця і автор інтригуючих романтичних історій, яка вміло змішує в своїх творах Фентезійні історії і любовні романи. Всі книги Дженніфер Л. Арментраут розраховані головним чином на представників прекрасної половини людства. Упор в них зроблений на любовні відносини, неймовірну глибину почуттів і палку пристрасть. Книги письменниці публікуються з 2011 року, але справжня популярність до неї прийшла після проведення «Обсідіан», яка лягла в основу серії «Лакс». Купити книги Дженніфер Л. Арментраут варто всім поціновувачам палких романтичних історій, які розгортаються в світах, наповнених магією, лицарями і фантастичними істотами.');
/*!40000 ALTER TABLE `author` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-12-04 19:13:18
